package com.jjsd.options.dao;

import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

/**
 * Created by zhujing on 2017/8/5.
 */

@RunWith(SpringRunner.class)
@SpringBootTest
public class NewsRepositoryTest {

    @Autowired
    private NewsRepository newsRepository;

    @Test

    public void go(){
//        News news=new News();
//        news.setTitle("浦发银行2017年1季报点评:好于同业水平,积极关注");
//        news.setText("投资要点\n" +
//                "\n" +
//                "    1季报亮点:1、手续收入同比5%,优于行业,信用卡等业务高速增长;2、汇兑收益、投资收益快增;3、资产质量平稳。1季报不足:1、费用增长较快。\n" +
//                "\n" +
//                "    投资建议:浦发银行16、17E PB 1.06X/0.9X(股份行0.92X/0.8X);PE 6.13X/5.8X(股份行6.41X/6.05X)。浦发银行1季度报表好于同行业,尤其是在全年1季度高基数的背景下。当然,浦发银行全年4个季度业绩分布被打乱(1季度很好,4季度较弱),使得浦发的季报可比性降低。浦发的基本面属于股份行中的优质(仅次于招行);中长期建议积极关注。\n" +
//                "\n" +
//                "    银行(尤其是股份行)1季度收入增速会是低点,市场已有预期:利息收入端,营改增对同比增速负面影响较大,同时1季度负债端付息率上升,而贷款端传导较慢。展望2季度,贷款端利率会逐渐上升,对净息差会有正面贡献,净息差全年不用悲观。手续费收入,理财收入下降较快(理财付息率上升),保险代理收入同比下降(万能险);手续费增速,由于监管态势,全年不能乐观。\n" +
//                "\n" +
//                "    银行内板块选择,如我们年初所讲,今年投资要重视“两头”:一是有稳定收益的低估值的大银行(包括稳健经营的招行);二是高弹性(业绩和股价)的小银行(宁波、南京和次新银行股)。我们更好看好资金端有优势、经营合规的大行(工行+农行)。\n" +
//                "\n" +
//                "    季报点评: 1季报概述。浦发银行1Q17营收、拨备前利润、净利润同比增速分别为0.3%、3.1%、3.9%。\n" +
//                "\n" +
//                "    1季度净息差环比平稳。1季度净利息收入环比增长0.9%(全年4季度较弱),生息资产环增0.5%,贷款环比增长6.2%,可推知净息差环比有所下降,我们测算的单季年化净息差环比下降3bp,较4季度对业绩负向贡献程度减弱。生息资产收益环比上升25bp,计息付息率环比上升30bp。\n" +
//                "\n" +
//                "    1季度资产负债环比变化:贷款增速高于生息资产,同业资产压缩。1季度资产负债增速变化:贷款环增6.2%、债券投资环比增长2%(交易类环比增长61%)、同业资产环比下降35%(存放同业环增-42%、买入返售环增-87%,变动原因为拆放境内非银行金融机构资金、买入返售债券规模减少);存款环比增长3.2%(活期环比增长3.9%、定期环比增长3.4%)、同业负债环比下降\n" +
//                "\n" +
//                "    5.4%(卖出回购环比下降78%,卖出回购债券及票据规模减少)。1季度资产负债结构变化:贷款、债券投资占比提升2.7%、0.6%,同业资产占比下降2.2%。负债端存款、发债占比提升1.4%、0.4%(活期存款占比提升0.3%);同业负债占比降1.9%。\n" +
//                "\n" +
//                "    手续费增速较同业靓丽,占比营收29%。1Q16、1H16、1-3Q16、2016全年、1Q17净手续费收入同比增长68%、52%、47%、46%、5%。1季度净手续费收入环增28%。增速放慢,预计与理财、代理等同比下降、但信用卡等业务发展迅猛。 净其他非息收入同增32%,主要为汇兑净损益增长较多(受市场汇率波动影响)、投资收益同增86%(贵金属投资收益增加)。\n" +
//                "\n" +
//                "    成本收入比下降。1Q17成本收入比22.6%,环比下降0.61%,同比上升3.7%。业务及管理费用同比增长20%、环比增长-16%。\n" +
//                "\n" +
//                "    资产质量较平稳。1季度不良净生成平稳。1季度不良率1.92%,环比上升3bp、同比变动32bp。1Q17累计年化不良净生成1.8%(测算值)、环比下降44bp。1季度核销力度减弱,环比减少31.29%。不良先行指标向好:关注类占比总贷款3.65%,环比下降17bp。由于浦发4季度的资产质量低于预期,资产质量改善幅度需要持续观察。\n" +
//                "\n" +
//                "    拨备对不良覆盖能力减弱。拨贷比3.2%,环比上升1bp。存量拨备对不良覆盖能力较去年4季度减弱,1Q17拨备覆盖率166.82%,环比下降2.31%。\n" +
//                "\n" +
//                "    资本压力有所缓解,核心资本充足率上升。风险加权资产同增10.5%,环比增长1.3%。核心一级资本充足率8.72%,环比上升19bp,同比上升11bp;资本充足率11.77%,环比上升12bp,同比下降33bp。\n" +
//                "\n" +
//                "    风险提示:经济下滑超预期。");
//
//        news.setDate(new Date());
//        newsRepository.save(news);



    }

}